<template>
    <div>
        
        <h1>基本信息</h1>
        秦玄龙
性别：男
年龄：23

电话：15956793981
邮箱：1470681411@qq.com





 	求职意向


意向岗位：前端开发	意向城市：南京	期望薪资：面议
求职类型：社招		

 	相关技能


1.	熟悉Vue.js, vue-router, vuex 等技术栈
2.	熟悉React，react-router-dom，redux  等技术栈
3.	熟练使用 element-ui，vant 等 ui 框架
4.	熟悉 MicroApp 前端微服务框架
5.	熟悉 three.js 库，熟悉 web worker 线程和通讯
6.	喜欢研究新技术，并对新技术保持高度关注

 	工作经历


2021.7-至今	南京鼎航
web 前端开发 | IT服务

1.	根据设计图精确还原页面，熟练运用CSS3属性实现页面交互动画
2.	使用 axios技术配合vue实现后台json等数据的转化和渲染
3.	主要使用技术 vue2.0，element-ui，MicroApp 框架， VtuWeapp-ui , vant-ui
4.	对常用业务代码进行封装成常用的组件
5.	后台管理系统的功能维护, 功能点的开发
6.	定期完成代码的更新迭代，以及优化现有代码 
期间参与项目有：鼎薪宝后台管理系统的维护、结算平台管理系统的维护、鼎薪宝小程序、鼎薪宝官网等。
鼎税猫后台管理系统 、 鼎建宝官网等。

2020.7-2021.5	江苏亿方众能电子科技有限公司
前端开发 | 互联网

1、使用HTML、Css编写页面，通过优雅降级，处理各种浏览器兼容性问题。
2、使用javascript实现页面中需要效果。
3、使用three.js实现3D可视化展示，对three.js 进行 vue 的组件化封装。
4、运用jQuery、element-ui、vant-ui等框架库，提高开发效率。
5、通过Ajax+Jsonp与后台数据进行交互，与后端工作有效对接，优化网站前端性



 	项目经历


2022.5-2022.11	统一运维平台
web 前端

项⽬描述：本项⽬是后台管理系统项目，统一登录入口，使⽤vue+webpack构建的单页⾯应⽤，项⽬采⽤了vuex、vue-route、MicroApp 框架 ，ES6语法 element-ui，采⽤组件化思想搭建整个项⽬，从⽽使组件⾼度复⽤，代码简洁。
岗位职责：负责项⽬静态页面，页面交互效果，配合后端的接口联调，解决浏览器页⾯适配。
项⽬架构：
1.	使⽤vue框架，以及vue-router构建单页⾯应⽤。 
2.	MicroApp 框架，管理子应用入口
3.	使⽤vue+vue-cli构建项⽬环境。 
4.	使⽤阿⾥⽮量图标库。
技术要求：
1.	基于vue-cli来搭建项⽬⼯程，配置第三⽅插件； 
2.	使⽤vue框架，vue-router搭建项⽬路由，vuex来实现单⽂件组件和数据的抽离 
3.	使⽤element-ui 组件实现表单，表格的快速开发
4.	合理使⽤钩⼦函数，实现数据的监听、渲染页⾯、页⾯节点的实例化功能。

2021.4-2021.5	鼎税猫小程序
web前端

项目描述：本项目是一个是对企业提供税筹和财税的小程序。使用微信小程序原生开发，vtuWeapp-ui 库，并且采用组件化思想搭建整个项目，从而使组件高度复用，代码十分简洁。 
岗位职责：主要负责项目静态页面，基本交互效果，配合后端的对接联调，手机端页面适配
主要负责
1.	负责移动产品wxml、wxss的编写，数据交互，解决移动端适配问题；
2.	实现产品UI和交互方面的开发需求，确保产品具有优质的用户使用体验。
技术要求：
1.	熟悉 JavaScript，css3，小程序原生组件
2.	熟悉 vtuWeapp-ui 库

2022.5-2022.8	鼎建宝小程序
web前端

项目描述：本项目，用工企业发布任务，个人接单的小程序。使用微信小程序原生开发，vtuWeapp-ui ，vatn-ui库，并且采用组件化思想搭建整个项目，从而使组件高度复用，代码十分简洁。 
岗位职责：主要负责项目静态页面，基本交互效果，配合后端的对接联调，手机端页面适配
主要负责
1.	负责移动产品wxml、wxss的编写，数据交互，解决移动端适配问题；
2.	实现产品UI和交互方面的开发需求，确保产品具有优质的用户使用体验。
2、工作内容
1.	负责ui界面的呈现，页面交互
2.	小程序，富文本展示效果的优化
3.	熟悉 JavaScript，css3，小程序原生组件

2020.9-2021.3	3D可视化编辑平台
web前端开发

该项目的主要实现目标是人人都可以编辑3D化个人场景，实现自己个人主页的多样化展示。
该系统使用Vue+Vuex+Vue+router+axios，Worker，IndexDB，three.js，html2canvas技术，采用vue组件式，
实现html页面拖拽式编辑，3D场景scene的编辑，参数的调整，使用
worker+indexDB的方式实现了，模型本地缓存
最终，项目列表的管理，secneLight光线，材质参数的调整，支持粒子动画（下雨）效果等。
主要负责
1.	模型本地缓存，创建worker进行消息通讯，indexDB，three.js加载模型文件 web worker 进行存储，解决模型重复加载及优化。
2.	用使用时，历史记录的存储，切换历史记录
3.	vue组件，封装three.js中对象，加载器
4.	制作天空盒子，下雨动画，相机移动时，碰撞检测
5.	使用html2canvas截取网页预览效果
6.	鼠标点击，射线检测3D场景内的物体，实现点击效果。

 	教育经历


2018.9-2021.7	六安职业技术学院
软件技术 | 大专

 	案例展示


官网地址
https://web.dingshuimao.com/
https://djb.dingshuimao.com/

    </div>
</template>

<script setup lang="ts">

</script>

<style scoped>

</style>